<!--
    Translation of GIT Committish: eade1a16e1d4f70a9d65bea41e02013c65e9f903



  

    When revising a translation, copy the HEAD committish of the
    version that you are working on.  Refer to `UPDATE A TRANSLATION'
    in README for details.
!-->

<h1>Warum sollte man zu LilyPond wechseln?</h1>


<p class="boxoutleft boxout" align="right" style="max-width:50%;">
<font size="+1">
  &bdquo;&hellip;music produced by LilyPond is exceptionally pretty&hellip;&ldquo;
  <br>
  (&bdquo;&hellip;mit LilyPond gesetzte Musik ist au&szlig;ergew&ouml;hnlich sch&ouml;n&hellip;&ldquo;) -
  <a href="http://www.computertotaal.nl">Computer!Totaal</a>.
  </font>
</p>

<a href="@IMAGES@lilypond-book.png">
<img style="float: right;" src="@IMAGES@lilypond-book-small.png" align="right" alt="lilypond-book">
</a>

<dl>
  <dt>Textbasierte Eingabe</dt>
  <dd>
    LilyPond verarbeitet ASCII-Quelltexte, die Sie in <em>Ihrer</em>
    Lieblingsumgebung schreiben k&ouml;nnen, schnell und bequem. 
    Kein Herumr&uuml;cken mit der Maus mehr n&ouml;tig. Der Eingabe-Text
    enth&auml;lt alle wichtigen Informationen, man muss sich also keine langen
    Kommandos merken. Ein Quelltext kann einfach sp&auml;ter wieder hervorgeholt und
    weiterverwendet werden.
  </dd>

  <dt>Kein Herumfummeln</dt>
  <dd>
    Verschwenden Sie nicht ihre Zeit damit, die Notenausgabe anzupassen. LilyPond 
    setzt Ihre Noten gleich von Anfang an richtig. Es entscheidet selbst &uuml;ber
    die Weite der Notenabst&auml;nde und umbricht Zeilen und Seiten so, dass ein einheitliches,
    dichtes Notenbild entsteht. &Uuml;berschneidungen zwischen Text, Noten und 
    Akkord-Beschriftungen werden automatisch aufgel&ouml;st und Phrasierungsb&ouml;gen und
    Balken <em>automatisch</em> geneigt!
  </dd>

  <dt>Hervorragender klassischer Notensatz</dt>
  <dd>
    Alle Einstellungen, die Gestaltung der Schriftart und die Algorithmen sind von
    qualitativ hochwertiger handgesetzter Musik inspiriert. Die Ausgabe von LilyPond
    hat den gleichen kr&auml;ftigen und ausbalancierten Ausdruck wie ein
    klassischer Musikdruck. (<a
    href="../about/automated-engraving/typography-features.html">Mehr dazu</a>)

    <img src="@IMAGES@flat-design.png" align="right" alt="flat-design">
  </dd>

  <dt>Integration von Noten in den Flie&szlig;text</dt>
  <dd>
    Setzen Sie Notenfragmente in einem Text, ohne Bilder auszuschneiden und wieder
    einzuf&uuml;gen. LilyPond-Notensatz l&auml;sst sich nahtlos in LaTeX oder HTML 
    integrieren oder in OpenOffice.org mit 
    <a href="http://ooolilypond.sourceforge.net/">ooolilypond</a> einf&uuml;gen.
   </dd>

  <dt>Besser als ein Stimmenauszug!</dt>
    <dd>
      Stimmen und Partitur werden aus denselben Quelltexten erstellt, sodass
      sich jede &Auml;nderung auch automatisch in beiden wiederfindet
      (<a href="howto.html#orchestral">Vgl. eine Demonstration</a>). Zus&auml;tzlich
      kann LilyPond Notensysteme in Partituren kombinieren und Stichnoten aus anderen
      Stimmen einf&uuml;gen.
    </dd>

  <dt>Freie Software</dt>
  <dd>
    LilyPond kann gratis heruntergeladen werden! Ja &ndash; es ist umsonst.
    Laden Sie es von der <a href="../install">Download-Seite</a>.
  
    <p>
      Es ist dazu auch noch freie (wie in &bdquo;Freie Rede&ldquo;) Software. Der Quelltext ist
      ebenfalls frei und beinhaltet die Erlaubnis, zu &auml;ndern oder zu kopieren.
      St&ouml;rt also ein Fehler oder fehlt eine Funktion? Schreiben Sie den Zusatz
      doch einfach selber, oder <a href="../sponsor/">bezahlen Sie jemanden</a>, der es f&uuml;r Sie erledigt.
    </p>
  </dd>

  <dt>Erweiterbares Design</dt>
  <dd>
    Alle Einstellungen k&ouml;nnen ver&auml;ndert werden, um Ihrem pers&ouml;nlichen
    typographischen Geschmack zu entsprechen. Wenn das noch nicht genug ist, gibt
    es immer noch die eingebaute Skript-Sprache, ein Dialekt der m&auml;chtigen Sprache LISP.
    Einstellungen, Variablen und Funktionen sind alle in einem Programmierhandbuch dokumentiert.
  </dd>

  <a href="@IMAGES@screenshot-macos.png"><img src="@IMAGES@screenshot-macos-small.png" align="right"
					      alt="LilyPond auf MacOS" caption="bla"></a>

  <dt>Hervorragende Unterst&uuml;tzung</dt>
  <dd>
    LilyPond l&auml;uft auf allen g&auml;ngigen Platformen: Linux, MacOS X, Windows.
    Mit dem Programm werden ein 400 Seiten starkes Handbuch und &uuml;ber 400 Beispieldateien
    installiert. Es gibt eine aktive Benutzergemeinde, die Fragen &uuml;ber die 
    <a href="http://news.gmane.org/gmane.comp.gnu.lilypond.general">Lilypond-User</a>-Mailing-Liste
    beantwortet, w&auml;hrend das
    <a href="../about/thanks.html">Entwicklerteam</a> Probleme schnell und zuverl&auml;ssig l&ouml;st.
    Auf deutsch helfen die Benutzer des <a href="http://www.lilypondforum.de">LilyPond-Forums</a>
    sehr zuvorkommend.
  </dd>

</dl>

<h2>Die Meinung anderer</h2>

Vertrauen Sie nicht nur uns, sondern 
 <a href="testimonials.html">sehen</a> Sie auch, was andere &uuml;ber LilyPond denken.
