<!--
    Translation of CVS Revision: 1.31
    
    Translators must leave this comment in tact, but remove any dollar
    signs ($) from the CVS Revision indicator.

    When revising a translation, copy the CVS Revision number from the
    original source file.  !-->

<h1>Les raisons de passer &agrave; LilyPond</h1>

<p class="boxoutleft boxout" align="right" style="max-width:50%;">
<font size="+1">
  &ldquo;...&nbsp;La musique produite par LilyPond est exceptionnellement belle&nbsp;...&rdquo; -
  <a href="http://www.computertotaal.nl">Computer!Totaal</a>.
  </font>
</p>

<a href="@IMAGES@lilypond-book.png">
<img style="float: right;" src="@IMAGES@lilypond-book-small.png" align="right" alt="lilypond-book">
</a>


<dl>
  <dt>Entr&eacute;e sous forme de texte brut</dt>
  <dd>
    LilyPond prend en entr&eacute;e un fichier texte, que vous pouvez &eacute;diter
    dans <em>votre</em> environnement favori, rapidement et
    confortablement. Fini les prises de t&ecirc;te avec la souris. Le
    fichier source contient toute l'information, ainsi vous n'avez
    pas besoin de vous souvenir de s&eacute;quences de commandes
    complexes. Enregistez simplement un fichier source pour pouvoir le
    r&eacute;utiliser par la suite.
  </dd>

  <dt>Associez musique et texte</dt> <dd> 
  	Ins&eacute;rez des morceaux de
  musique dans des textes sans avoir besoin de couper puis coller des
  images. Avec l'utilitaire <tt>lilypond-book</tt>, vous pouvez
  int&eacute;grer de fa&ccedil;on transparente de la musique dans un document LaTeX
  ou HTML.  </dd>

  <dt>Pas de bricolage</dt>

  <dd>
   Ne perdez pas votre temps &agrave; retoucher le r&eacute;sultat&nbsp;; LilyPond
   produit un formatage correct d&egrave;s le d&eacute;part. Le programme d&eacute;termine
   lui-m&ecirc;me l'espacement, les sauts de ligne et de page afin
   d'obtenir une mise en page serr&eacute;e et uniforme. Les collisions entre
   les paroles, les notes et les accords sont r&eacute;solues, la courbure
   des liaisons et la pente des fuseaux sont d&eacute;termin&eacute;s, tout cela
   <em>automatiquement</em>&nbsp;!
  </dd>

  <dt>Une excellente gravure traditionnelle</dt>
  
  <dd>
    Tous les aspects stylistiques, designs des polices et algorithmes
    ont &eacute;t&eacute; inspir&eacute;s par les plus belles partitions grav&eacute;es
    traditionnellement. Le r&eacute;sultat produit par LilyPond a le m&ecirc;me
    aspect solide et &eacute;quilibr&eacute; qu'une partition traditionnelle.
    (<a href="../about/automated-engraving/typography-features.html">En
    savoir plus</a>)
    
    <img src="@IMAGES@flat-design.png" align="right" alt="flat-design">

    </dd>

  <dt>Encore mieux que l'extraction des parties s&eacute;par&eacute;es&nbsp;!</dt>

    <dd>
    Les parties et le conducteur peuvent &ecirc;tre r&eacute;alis&eacute;s &agrave; partir du
    m&ecirc;me fichier source, ainsi tout changement est r&eacute;percut&eacute; &agrave; la fois
    dans le conducteur et les parties (<a
    href="howto.html#orchestral">d&eacute;monstration</a>). De plus, LilyPond
    peut combiner des port&eacute;es et ins&eacute;rer des citations d'autres parties.
    </dd>

  <dt>Un logiciel libre</dt>

  <dd>LilyPond peut &ecirc;tre t&eacute;l&eacute;charg&eacute; gratuitement&nbsp;!
  Si si - c'est gratuit. R&eacute;cup&eacute;rez-le sur la <a href="../install">page
  de t&eacute;l&eacute;chargement</a>.
  
    <p>
      De plus c'est aussi un logiciel libre. Son code source est
      disponible librement, vous pouvez le modifier et le
      copier. &Ecirc;tes-vous irrit&eacute;s par un bug, ou trouvez-vous
      qu'une fonctionnalit&eacute; manque&nbsp;? Ajoutez-la simplement
      vous-m&ecirc;me, ou payez quelqu'un pour le faire.
    </p>
  </dd>

  <dt>Un design extensible</dt>
  <dd>
    Vous pouvez modifier tous les param&egrave;tres selon vos pr&eacute;f&eacute;rences
    typographiques. Et si &ccedil;a ne suffit toujours pas, il y a Scheme, le
    langage de script int&eacute;gr&eacute;, qui est un dialecte du puissant langage
    LISP. Les param&egrave;tres, variables et fonctions sont enti&egrave;rement
    document&eacute;s dans le manuel de r&eacute;f&eacute;rence du programme.
  </dd>

  <dt>Un excellent support</dt>
  <dd>
    LilyPond tourne sur toutes les plateformes r&eacute;pandues&nbsp;: Linux,
    MacOS X et Windows. LilyPond est fourni avec un manuel utilisateur
    de 230 pages et plus de 400 fichiers-exemples. Une communaut&eacute;
    d'utilisateurs active r&eacute;pond aux questions sur la liste de diffusion
    <a href="http://news.gmane.org/gmane.comp.gnu.lilypond.general">Lilypond
    user</a>, tandis que
    <a href="../about/thanks.html">l'&eacute;quipe de d&eacute;veloppement</a>
    assure une r&eacute;solution rapide des probl&egrave;mes.
  </dd>
</dl>

<h2>T&eacute;moignages</h2>

Ne nous croyez pas sur parole&nbsp;; lisez plut&ocirc;t <a
href="testimonials.html">ce qu'en pensent les autres</a>.
