<!--
    Translation of CVS Revision: 1.21 
    
    Translators must leave this comment in tact, but remove any dollar
    signs ($) from the CVS Revision indicator.

    When revising a translation, copy the CVS Revision number from the
    original source file.  !-->


<h1>T&eacute;moignages</h1>

<div style="overflow: auto">
<img style="float: right; padding: 5px;" height="135" src="@IMAGES@/carter-brey.jpeg">
<p>
  &ldquo;... J'avais &eacute;crit avec Encore quelques pi&egrave;ces pour
  violoncelle solo. Je les ai imprim&eacute;es avec LilyPond avant de
  les soumettre &agrave; Schirmer en vue de les publier. J'en mettrais
  ma main &agrave; couper que leur &eacute;dition ne sera jamais aussi
  pointue que la mienne&nbsp;!&rdquo;
</p>
<p align="right">
    <a
    href="http://www.newyorkphilharmonic.org/meet/orchestra/index.cfm?page=profile&amp;personNum=7">Carter
    Brey</a>, <em>Premier violoncelle, Philharmonique de New York</em>
</p>
</div>

<div style="overflow: hidden">
<img style="float: left; padding: 5px;" height="135" src="@IMAGES@/orm-finnendahl.jpeg">
<p>
  &ldquo;Bien que ma ma&icirc;trise [de LilyPond] soit pour l'instant
  imparfaite, je suis n&eacute;anmoins <em>tr&egrave;s</em>
  impressionn&eacute;. J'ai utilis&eacute; ce programme pour un motet
  de Josquin Desprez en notation mensurale et je dois dire que
  lilypond  d&eacute;passe de loin tous les autres programmes de
  notation tant au niveau de la rapidit&eacute;, que de l'ergonomie et
  du r&eacute;sultat&nbsp;!&rdquo;
</p>
<p align="right">
  <em>
    <a href="http://icem-www.folkwang-hochschule.de/~finnendahl/">
      Orm Finnendahl, Professeur de composition, &Eacute;cole
      sup&eacute;rieure de musique de Fribourg (Allemagne)
    </a>
  </em>
</p>
</div>

<div style="overflow: hidden">
<p class="boxout boxoutright"> 
<img src="@IMAGES@/darius-blasband.jpeg">
<br>
Le compositeur Darius Blasband &eacute;tudiant une
partition LilyPond.</p>

<p>
  &ldquo; [..Apr&egrave;s la premi&egrave;re r&eacute;p&eacute;tition d'orchestre] 
  j'ai re&ccedil;u de nombreux compliments concernant la qualit&eacute; des partitions.
  Plus important, bien que l'apparence des partitions puisse &ecirc;tre
  am&eacute;lior&eacute;e par le biais de nombreuses commandes, c'est le
  r&eacute;sultat d'un code basique, sans retouches, que les musiciens
  ont utilis&eacute;.&rdquo;
</p>
<p align="right">
  <em>
    Darius Blasband,
    compositeur (Bruxelles, Belgique)
  </em>
</p>
</div>


<p>
  &ldquo;Merci et encore merci &agrave; l'&eacute;quipe des
  d&eacute;veloppeurs pour leur admirable travail. Je n'ai jamais
  rien vu qui approche le r&eacute;sultat que j'obtiens avec Lilypond
  &ndash; je suis absolument convaincu que mes besoins en terme
  d'&eacute;dition musicale seront largement satisfaits
  par cette superbe application. [...] une partition de base
  g&eacute;n&eacute;r&eacute;e  par Lilypond [...] a meilleure mine
  que la plupart des publications "professionnelles" auxquelles je l'ai
  compar&eacute;e, aussi bien de chez Warner Bros., que m&ecirc;me les
  plus r&eacute;centes productions des "bonnes vieilles maisons". [...]
</p>
<p>
  Faites donc mieux que Finale/Sibelius/Igor/et consorts&nbsp;!!!&rdquo;
</p>
<p align="right">
  <em>
    Kieren MacMillan, compositeur, Toronto (Canada)
  </em>
</p>

<p>
  &ldquo;Je pense que Lilypond est pr&ecirc;t pour
  "l'avant-sc&egrave;ne" &ndash; Je l'utilise depuis deux ans dans un
  cours de composition &agrave; l'universit&eacute;,
  &eacute;conomisant de fait des centaines de dollars (ou ce que peut
  co&ucirc;ter la version "bon march&eacute;" pour &eacute;tudiant de
  Finale ou Sibelius). Et nombreux sont-ils &agrave me
  demander&nbsp;:  "wow&nbsp;! Comment as-tu pu sortir une aussi
  chouette partition avec Finale&nbsp;?"&rdquo;
</p>
<p align="right">
  <em>
    <a href="http://www.sfu.ca/~gperciva/">Graham Percival</a>,
    &eacute;l&egrave;ve en composition et professeur de violoncelle.
  </em>
</p>

<p>
  &ldquo;Lilypond is obviously the zillion-ton gorilla [of great music
  typesetting].&rdquo;
</p>
<p align="right">
  <em>
    Chris Cannam, chef programmeur du projet
    <a href="http://www.rosegardenmusic.com/rosegarden/">RoseGarden</a>.
  </em>
</p>

<p>
  &ldquo;LilyPond est tout simplement g&eacute;nial [...] Plus j'en
  apprends sur LilyPond, plus je l'appr&eacute;cie&nbsp;!&rdquo;
</p>
<p align="right">
  <em>
    David Bobroff, Trombone basse, Orchestre symphonique d'Islande
  </em>
</p>

<p>
  &ldquo;J'avais une sorte de passion conflictuelle avec lui. Passion
  parce que la premi&egrave;re partition que j'en ai vu m'a vraiment
  &eacute;merveill&eacute;&nbsp;! Le descriptif de LilyPond ne dit pas
  tout de ses capacit&eacute;s, il est trop modeste&nbsp;! 
  [...] au fur et &agrave; mesure que LilyPond s'am&eacute;liore, et
  que je regarde de plus pr&egrave;s comment cela se passe avec
  Scheme, je suis de moins en moins frustr&eacute;. En fait, ce que je
  veux dire, c'est un grand merci de nous fournir LilyPond, c'est vraiment un
  bon programme.&rdquo;
</p>
<p align="right">
  <em>
    <a href="http://nicolas.sceaux.free.fr/">Nicolas Sceaux</a>,
     contributeur <a href="http://www.mutopiaproject.org">Mutopia</a>
  </em>
</p>


<p>
  &ldquo;&Agrave; vrai dire, LilyPond fait un boulot des plus
  &eacute;tonnants &ndash; et les fichiers de d&eacute;part sont
  <em>r&eacute;ellement</em> petits&nbsp;: 17 Ko pour cinq pages de musique
  moderne plut&ocirc;t complexe, c'est tout bonnement incroyable&nbsp;!&rdquo;
</p>
<p align="right">
  <em>
    <a href="http://www.troff.org/whoswho.html#werner">Werner Lemberg</a>,
    Chef au Th&eacute;&acirc;tre de Coblence (Allemagne) et
    &eacute;minent hacker GNU.
  </em>
</p>


<p>
  Je consid&egrave;re [que LilyPond est] un programme incroyable, et qu'il
  produit des choses d'excellente qualit&eacute;. Apr&egrave;s avoir
  lu une interview &agrave; son sujet l'an dernier, j'ai d&eacute;lir&eacute; avec
  plusieurs de mes amis sur son potentiel.
</p>
<p align="right">
  <em>Paul Davis, d&eacute;veloppeur de
    <a href="http://jackit.sf.net">JACK</a>
    et <a href="http://www.ardour.org">Ardour</a>.
  </em>
</p>



<h2>La raison de tous ces &eacute;loges&nbsp;?</h2>

<p>
  LilyPond imite au plus pr&egrave;s l'apparence de la musique
  grav&eacute;e &agrave; la main, ce que ne fait pas la plupart des
  autres programmes. Si vous voulez comprendre cette diff&eacute;rence, ou
  si tout simplement cela vous int&eacute;resse, lisez alors notre
  trait&eacute; sur la
  <a href="../about/automated-engraving/">gravure automatis&eacute;e
  de la musique</a>.
</p>
<p>
  Bien s&ucirc;r, vous pouvez continuer en observant LilyPond
  <a href="tour.html">en action</a>.
</p>
