<!--
    Translation of CVS Revision: 1.24
    
    Translators must leave this comment in tact, but remove any dollar
    signs ($) from the CVS Revision indicator.

    When revising a translation, copy the CVS Revision number from the
    original source file.  !-->

<h2>LilyPond par la pratique</h2>

<p>
  Avec LilyPond, nous avons tent&eacute de mettre &agrave; la
  disposition de tous la plus belle typographie qui soit en
  mati&egrave;re de musique. Voyons voir ce que cela signifie en pratique.
</p>

<h3>Des chansons</h3>

<p>
  L'une des choses que vous pouvez faire est de la musique
  populaire. En voici un exemple&nbsp;:
</p>

<p align="center">
  <a href="@IMAGES@sondag-morgen.png" title="Click to enlarge">
    <img width="450" src="@IMAGES@sondag-morgen-smaller.png"
	 alt="sondag-morgen">
  </a>
</p>
<p align="center">
  <em>Cliquez pour agrandir</em>
</p>

<p>
  Cet exemple nous montre des noms d'accords, de la notation pour
  percussion et des tablatures. Voyez la notation polyphonique pour le
  pupitre des cors, et notez comment les accords &ndash; "Em7" et 
  "Hm7" imprim&eacute;s en haut &ndash; utilisent la nomenclature danoise. Cette
  derni&egrave;re n'est qu'une simple option de mise en page. En inversant un
  contr&ocirc;leur, vous obtiendrez des accords &agrave; l'anglaise.
</p>

<h3>La musique classique</h3>

<p>
  Notre travail sur LilyPond tire son inspiration de la gravure
  traditionnelle. La musique classique ne lui pose donc aucun
  probl&egrave;me. De simples solos s'obtiennent en un tour de main,
</p>

<p align="center">
  <a href="@DOC@v2.6/input/mutopia/J.S.Bach/out-www/baerenreiter-sarabande.pdf"
     title="Click for a PDF file">
    <img src="@IMAGES@sarabande.png" alt="sarabande">
  </a>
</p>
<p align="center">
  <em>Cliquez sur l'image pour obtenir un fichier PDF</em>
</p>

<p>
  et avec un peu de travail, des &oelig;uvres complexes sont aussi
  r&eacute;alisables&nbsp;
</p>

<p align="center">
  <a href="@DOC@v2.6/input/out-www/les-nereides.pdf"
     title="Click for a PDF file">
    <img src="@IMAGES@les-nereides.png" alt="les-nereides"></a>
</p>
<p align="center">
  <em>Cliquez sur l'image pour obtenir un fichier PDF</em>
</p>

<p>
  D'autres extraits de versions plus r&eacute;centes de LilyPond sont
  accessibles dans les pages de documentation. Il y a des pages
  s&eacute;par&eacute;es pour les versions <a
  href="@DOC@v2.6/examples.html">stable</a> et de
  <a href="@DOC@v2.7/examples.html">d&eacute;veloppement</a>.
</p>

<h3>R&eacute;cup&eacute;rer de la musique en ligne</h3>

<p>
  LilyPond est libre et gratuit, c'est donc un format s&ucirc;r pour
  &eacute;changer et archiver de la musique. Si un compositeur est
  mort depuis plus de 70 ans, alors sa musique est dans le domaine
  public. Elle peut &ecirc;tre librement incluse dans une
  biblioth&egrave;que (num&eacute;rique). C'est ce dont s'occupe le <a
  href="http://www.mutopiaproject.org">projet Mutopia</a>&nbsp;: une 
  collection de musique au format LilyPond.
</p>

<p align="center">
  <a href="http://www.mutopiaproject.org">
    <img src="@IMAGES@mutopia.png" alt="mutopia">
  </a>
</p>

<p>
  Toute la musique disponible chez Mutopia est dans le domaine public,
  vous pouvez donc la t&eacute;l&eacute;charger et l'imprimer sans que
  cela vous co&ucirc;te. Si vous n'&ecirc;tes pas satisfait,
  modifiez-en les doigt&eacute;s, transposez-la, r&eacute;utilisez-la
  dans vos propres compositions. 
</p>

<h3>Imprimer des bases de don&eacute;es</h3>

<p>
  LilyPond peut tourner sans surveillance. Par exemple, on peut
  tr&egrave;s facilement convertir automatiquement toute une base de
  donn&eacute;es musicales &agrave; partir d'un script.  Ainsi le d&eacute;partement
  d'informatique de l'universit&eacute; d'Utrecht a mis en ligne un  <a
  href="http://teuge.labs.cs.uu.nl/Rntt/mir/mir.cgi?pwd=none">service
  de recherche</a>, avec pr&egrave;s d'un demi million de fragments
  pour retrouver des morceaux. Les fonctions automatis&eacute;es de
  LilyPond ont fourni la partition pour chacun d'eux.
</p>

<p align="center">
  <img src="@IMAGES@give-labs.png" alt="give-labs">
</p>

<h3>Curieux&nbsp?</h3>

<p>
  Allez voir <a href="howto.html">comment de telles partitions</a>
  sont faites. 
</p>
