<!--
    Translation of GIT committish: 87c2f57a33542aae1323887065cb3fbb2e7a319b  

    When revising a translation, copy the HEAD committish of the
    version that you are working on.  Refer to `UPDATE A TRANSLATION'
    in README for details.
!-->

<img src="@IMAGES@double-lily.png" width="200"  align="right" alt="lily logo">

<h1>Wo erhalte ich Hilfe?</h1>

<p align="right"><em>
  &bdquo;Ein sch&auml;ner Gegenstand ist eine immerw&auml;hrende Freude&ldquo;
  <br>
  John Keats</em>
</p>

<p>
LilyPond ist ein textbasiertes Werkzeug.  Es besitzt <em>keine</em> graphische
Benutzeroberfl&auml;che mit Men&uuml;punkten und Hilfefenstern.  Darum
m&uuml;ssen Benutzer, die an eine grafische Oberfl&auml;che wie etwa in
Windows gew&ouml;hnt sind, erst lernen, wie man mit diesem Programm
arbeitet.  Es gibt verschiedene Quellen, die neuen Benutzer
den Anfang erleichtern und einf&uuml;hren in LilyPonds Art und Weise,
sch&ouml;nen Notensatz zu produzieren.
</p>



<h2>Der LilyPond-Intensivkurs</h2>

<p>
  The <a href="switch/howto.html">LilyPond-Intensivkurs</a> zeigt
  eine kurze &Uuml;bersicht über die wichtigsten Elemente
  von LilyPond. Gleichzeitig wird gezeigt, wozu das Programm f&auml;hig
  ist. Der Intensivkurs allein reicht jedoch nicht aus um zu
  verstehen, wie LilyPond effektiv genutzt werden kann. Hier
  hilft aber...
</p>

<h2>Das LilyPond Handbuch zum Lernen</h2>

<p>
  Das <a href="http://lilypond.org/doc/v2.11/Documentation/user/lilypond-learning/index">LilyPond Handbuch zum Lernen</a>
  wurde sowohl f&uuml;r
  neue LilyPond-Benutzer geschrieben also auch für alle, die
  schon mit einer vorigen Version von LilyPond gearbeitet haben.
  Hier werden die Grundlagen von LilyPond behandelt. Das Handbuch
  bietet deshalb die M&ouml;glichkeit, sehr effektiv mit LilyPond
  vertraut zu werden. Lesen Sie das Handbuch zum Lernen von vorne
  bis hinten, wenn Sie das bis jetzt noch nicht getan haben.
  (Da das Handbuch zum Lernen der Version 2.11 sehr viele
  Verbesserungen erfahren hat, sollten alle Benuzter, auch die
  der Version 2.10, dieses Handbuch lesen. Wenn Sie sich durch
  dieses Handbuch gearbeitet haben, k&ouml;nnen Sie sich schon recht
  gut orientieren und wissen, wie Sie Notensatz mit LilyPond
  produzieren. Ab und zu kommen aber bestimmte Probleme auf, für
  die Sie hier Hilfe finden:
</p>
 
<h2>Die LilyPond-Dokumentation</h2>

<p>
  Zus&auml;tzlich zum Handbuch zum Lernen beinhaltet die LilyPond-Dokumentation
  f&uuml;r die
  <a href="http://lilypond.org/documentation">stabile Version</a> oder die
  <a href="http://lilypond.org/doc/v2.11/Documentation">Entwicklungsversion</a>
  eine Notationsreferenz, ein Handbuch zur Programmbenutzung und
  eine Referenz der Interna. Diese Handb&uuml;cher, die im
  Internet gelesen werden, aber auch auf dem Computer installiert
  werden k&ouml;nnen, erkl&auml;ren die Feinheiten der Arbeit mit LilyPond.
</p>

<h2>Zusätzliche Hilfe</h2>

<p>
  Neben der LilyPond-Dokumentation finden Sie Information in der
  <a href="about/faq.html">LilyPond FAQ</a> und dem
  <a href="http://lilypondwiki.tuxfamily.org"> LilyPond
  Wiki</a>.  Auch wenn es sich nicht um eine offizielle
  LilyPond-Seite handelt, findet sich im Wiki dennoch Information,
  die besonders hilfreich für neue Benutzer sein kann.
</p>

<p>
  Das <a href="http://lsr.dsi.unimi.it">LilyPond Schnipseldepot</a> 
  enth&auml;lt Fragmente von LilyPond-Dateien, die erstellt wurden,
  um bestimmte Probleme zu l&ouml;sen. Eine Suche in dieser Datenbank
  hilft oft sehr schnell weiter, weil jemand schon die Antwort zu
  dem Problem gefunden hat und ein Schnipsel bereitgestellt hat.
</p>
  
<h2>Die lilypond-user Mailingliste</h2>

<p>
  Wenn Sie ihre Probleme nicht mit Hilfe der bereits genannten
  Ressourcen l&ouml;sen konnten, gibt es noch das
  <a href="http://www.lilypondforum.de/index.php?PHPSESSID=19dae47b711c10040261931857443e92;www">deutsche LilyPond-Forum,</a>
  in dem Sie Ihre Frage stellen k&ouml;nnen. Eine gr&ouml;&szlig;ere Gemeinde hilft in der
  englischsprachigen offiziellen lilypond-user-Mailingliste.
  Sie k&ouml;nnen sich bei der Liste auf der
  <a href="http://lists.gnu.org/mailman/listinfo/lilypond-user">
  lilypond-user Anmeldeseite</a> registrieren.
  Bevor Sie Fragen stellen, sollten Sie das Archiv durchsuchen, ob Ihre Frage
  nicht schon fr&uuml;her einmal beantwortet wurde. Unterschiedliche Oberfl&auml;chen
  finden sich unter
  <a href="http://lists.gnu.org/archive/html/lilypond-user/">
    den lilypond-user Archiven</a>, unter
  <a href="http://news.gmane.org/gmane.comp.gnu.lilypond.general"> gmane </a>,
  oder unter <a href="http://www.nabble.com/Gnu---Lilypond---User-f1722.html">
  Nabble</a>.  Sie k&ouml;nnen die Oberfl&auml;che benutzen, die Ihnen am n&auml;chsten liegt.
</p>

<p>
  Wenn Sie dann eine Frage auf der Liste stellen m&ouml;chten, haben Sie am meisten
  Erfolg mit einer wohlformulierten Frage.
  <a href="http://www.gerv.net/hacking/how-to-ask-good-questions/">
  Hier ein guter &Uuml;berblick</a> (auf englisch), wie derartige Frage aussehen können.
</p>

<h2>Melden von Fehlern</h2>

<p>
  Wie jedes Programm, enthält auch LilyPond Fehler und Begrenzungen. Wenn LilyPond
  makelhaften Notensatz produziert (wie etwa Zusammenst&ouml;&szlig;e von Objekten) oder
  abst&uuml;rzt oder sich anders verh&auml;lt als es in der Dokumentation beschrieben
  wird, teilen Sie uns bitten diesen m&ouml;glichen Fehler mit.
  <a href="devel/participating/bugs">Hinweise zur Fehlerberichten</a> 
  (auf Englisch) finden sich auf der LilyPond-Webseite.
</p>

<p>
  Neue Benutzer denken manchmal, LilyPond funktioniert nicht, w&auml;hrend es in
  Wirklichkeit korrekt installiert ist. <em>Bitte melden Sie keine Fehler,
  bevor Sie nicht das Handbuch zum Lernen gelesen haben und wissen, wie
  man LilyPond benutzt.</em>
</p>

