<!--
    Translation of CVS Revision: 1.40
    
    Translators must leave this comment in tact, but remove any dollar
    signs ($) from the CVS Revision indicator.

    When revising a translation, copy the CVS Revision number from the
    original source file.  !-->

<title>Foire Aux Questions</title>
<h1>Foire Aux Questions</h1>


<h2>Introduction</h2>

<h3>Qu'est-ce que LilyPond&nbsp;?</h3>
<p>
  LilyPond est un "syst&egrave;me de gravure automatis&eacute;e."
  Il &eacute;dite des partitions de qualit&eacute;, l'utilisateur n'ayant besoin d'aucune
  connaissance typographique.
</p>


<h3>Gravure automatis&eacute;e, &ccedil;a veut dire que la musique que je joue
  est directement imprim&eacute;e&nbsp;?</h3>

<p>
  Non. Notre syst&egrave;me suppose que les donn&eacute;es soient entr&eacute;es sous une forme
  exacte et abstraite. L'impression de musique &eacute;tant en soi difficile, nous
  n'avons pas voulu ajouter d'autres probl&egrave;mes. Traduire de mani&egrave;re
  exacte le jeu
  d'un musicien est ardu. M&ecirc;me si les bonnes hauteurs sont transmises par le biais
  d'un clavier MIDI (&agrave; l'oppos&eacute; d'un son enregistr&eacute;), il faut &eacute;galement que le rythme
  soit correct. Par exemple, comment l'ordinateur fera-t'il la
  diff&eacute;rence entre une croche et une noire jou&eacute;e staccato&nbsp;? D'ailleurs, comment imprimer une pi&egrave;ce que vous ne sauriez
  jouer de cette mani&egrave;re&nbsp;?
</p>

<h3>Il existe d'autres programmes de notation. Qu'a le votre
  de sp&eacute;cial&nbsp;?</h3>

<p>
  Les &eacute;ditions modernes informatis&eacute;es ont
  un aspect terne et m&eacute;canique. Au contraire, nous essayons d'imiter les
  gravures traditionnelles dans l'aspect g&eacute;n&eacute;ral, les algorithmes de rendu
  et le graphisme des polices. De ce fait, nos impressions proposent
  un bien meilleur aspect que celles de nos concurrents.
</p>

<h3>Quel est le d&eacute;faut des autres logiciels d'&eacute;dition&nbsp;?</h3>
<p>
<ul>
<li>
  C'est souvent l'absence du subtilit&eacute; dans les divers espacements qui
  provoque un aspect m&eacute;canique dans les &eacute;ditions informatis&eacute;es.
  <li>Afin d'&eacute;viter les chevauchements entre les diff&eacute;rents symboles,
  ceux-ci sont fort espac&eacute;s, donnant un aspect tr&egrave;s "a&eacute;r&eacute;."
  <li>La densit&eacute; de l'affichage correspond &agrave; cet aspect a&eacute;r&eacute;&nbsp;: les
  symboles sont g&eacute;n&eacute;ralement trop l&eacute;gers, et les lignes trop fines.
  <li>Un espacement large implique &eacute;galement un plus grand nombre de pages.
  <li>Les barres ne couvrent pas toujours les lignes de la port&eacute;e, alors que
  les liaisons de notes et de phras&eacute; se croisent, entra&icirc;nant des surcharges et des
  espaces vides autour de ces endroits.
</ul>
</p>

<p>
  Ces d&eacute;tails tiennent de l'ordre du subconscient. Comparer la 
  m&ecirc;me pi&egrave;ce, de pr&eacute;f&eacute;rence &agrave; la loupe, dans deux &eacute;ditions (l'une
  traditionnelle, l'autre faite par ordinateur) est le meilleur moyen de
  s'en rendre compte. Un indice&nbsp;: la gravure traditionnelle est la reproduction
  photographique d'un travail manuel, et se reconna&icirc;t aux l&eacute;g&egrave;res
  irr&eacute;gularit&eacute;s de placement des symboles, et aux petites taches d&ucirc;es
  au proc&eacute;d&eacute; de reproduction.</p>

<h3>Qu'est-ce que la gravure&nbsp;?</h3>
<p>
  &Agrave; l'origine, la musique &eacute;tait imprim&eacute;e en tamponnant et gravant les symboles
  retourn&eacute;s sur des plaques m&eacute;talliques. Celles-ci &eacute;taient encr&eacute;es, et le
  papier press&eacute; contre elles, permettant l'impession de gauche &agrave; droite. De ce
  fait, la typographie musicale est appel&eacute;e gravure, m&ecirc;me si elle est faite
  par ordinateur de nos jours. Les personnes qui r&eacute;alisent ce travail sont
  appel&eacute;s graveurs ou copistes.
</p>

<h3>Pourquoi tant s'int&eacute;resser &agrave; la gravure&nbsp;?</h3>
<p>
  Nous estimons que la belle musique m&eacute;rite d'&ecirc;tre imprim&eacute;e avec qualit&eacute;.
</p>

<h3>Pourquoi devrais-je m'y int&eacute;resser aussi&nbsp;?</h3>
<p>
  Une bonne
  &eacute;dition facilite la lecture, et le jeu n'en est que plus ais&eacute;. Par
  exemple, une pi&egrave;ce sera plus facilement interpr&eacute;t&eacute;e si sa mise en page
  refl&egrave;te son caract&egrave;re. Un espacement r&eacute;duit limite le nombre de pages,
  et par cons&eacute;quent le nombre de tournes. Un syst&egrave;me (une &ldquo;ligne&rdquo;)
  ayant un affichage horizontal unique sera plus facilement rep&eacute;rable
  dans le conducteur. Une partition imprim&eacute;e avec des symboles denses et
  des lignes &eacute;paisses sera mieux visible de loin.
</p>

<p>
  <h3>Vous dites votre programme sp&eacute;cial&nbsp;; vous essayez de le vendre&nbsp;?</h3>

<p>
  Non. Il est distribu&eacute; gratuitement. Rendez-vous sur la <a
					       href="../install">page de t&eacute;l&eacute;chargement</a>.
</p>

<h3>Il est gratuit maintenant, mais vous le vendrez plus tard&nbsp;?</h3>

<p>
  Non. Non seulement il est gratuit, mais nous fournissons &eacute;galement
  le code source complet, avec la permission de le redistribuer, le modifier,
  le vendre ou le mutiler. En d'autres termes, LilyPond est un
  logiciel libre&nbsp;;
  il fait partie du projet GNU, et est distribu&eacute; sous les termes de la
  <a href="http://www.gnu.org/copyleft/gpl.html">GNU General Public
  License.</a> 
</p>

<p>
  Nous pensons que ceci est plus important que le prix. Cela
  signifie que vous &ecirc;tes libre de corriger, modifier ou am&eacute;liorer le
  programme, ou de payer quelqu'un pour le faire. Nous ne vous obligerons pas
  &agrave; effectuer de mise &agrave; jour lorsque votre syst&egrave;me sera mis de c&ocirc;t&eacute;, et 
  vous ne serez pas perdu quand nous abandonnerons le programme.
</p>


<h3>Comment vous remercier pour LilyPond&nbsp;?</h3>

Plusieurs choses sont faisables.
<ul>
  <li>
    <p>
      Dites nous combien vous appr&eacute;ciez LilyPond, nous aimons toujours
      l'entendre&nbsp;: envoyez nous un courriel, ou une carte postale.
    </p>
    <blockquote>
      Jan &amp; Han-Wen<br>
      p/a Han-Wen Nienhuys<br>
      Spinozaweg 68<br>
      3532 SH Utrecht,<br>
      Hollande
    </blockquote>
    <p>
      Nous accueillons chaleureusement les extraits musicaux de votre choix
      :-).
    </p>
  </li>
  <li>
    Supportez directement le d&eacute;veloppement en envoyant un
    <a href="doneet.html">don</a>.
  </li>
  <li>
    Dites &agrave; tous combien vous appr&eacute;ciez LilyPond&nbsp;: publicit&eacute; veut
    dire plus d'utilisateurs, ce qui est toujours b&eacute;n&eacute;fique. Donc,
    
    <ul>
      <li>
	parlez de LilyPond &agrave; vos amis,
      </li>
      <li>
	ne supprimez pas le pied-de-page "Engraved by LilyPond" , et
      </li>
      <li>
	&eacute;voquez LilyPond si voulez l'utiliser dans des th&egrave;ses ou livres,
	ou citez nous dans des articles.
      </li>
    </ul>
  </li>
  
</ul>

<h3>Mais qui &ecirc;tes-vous&nbsp;?</h3>

<p>
  Nous sommes Jan et Han-Wen, de Hollande. Nous nous sommes rencontr&eacute;s au
  sein d'un orchestre de jeunes, o&ugrave; Jan bricolait des pr&eacute;processeurs
  MusicTex. Quand Han-Wen est arriv&eacute;, nous avons d&eacute;cid&eacute; de red&eacute;marrer
  avec une approche compl&egrave;tement diff&eacute;rente. Nous avons alors cr&eacute;&eacute;
  LilyPond.
</p>

<h3>Pourquoi ce nom&nbsp;?</h3>

<p>
  Han-Wen&nbsp;: j'ai commenc&eacute; Lily (notre petit nom pour LilyPond) en
  1996. Jusque l&agrave;, Jan et moi &eacute;tions musiciens dans un orchestre
  symphonique amateur. J'avais le b&eacute;guin pour une magnifique fille
  de l'orchestre qui s'appelait Suzanne, &eacute;tait fl&ucirc;tiste et
  violoncelliste, et (bien s&ucirc;r) je la trouvais tr&egrave;s belle.
</p>

<p>
  En m&ecirc;me temps, Jan sortait avec Roos (&lsquo;Rose&rsquo; en
  n&eacute;erlandais &ndash; &eacute;galement violoncelliste). Je connaissais aussi
  le logiciel Rosegarden (un s&eacute;quenceur MIDI et &eacute;diteur de partitions).
  En d&eacute;couvrant que &lsquo;Susan&rsquo; signifiait &lsquo;lys&rsquo;
  (<em>Lily</em>) en h&eacute;breu, j'ai pens&eacute; qu'appeler le programme
  &lsquo;LilyPond&rsquo; le faisait tout &agrave; fait correspondre &agrave; ce
  qu'&eacute;tait le reste de ma vie.
</p>

<p>
  Certaines choses ne durent pas - les deux filles, leur violoncelle
  et l'orchestre sont sortis de nos vies. Mais LilyPond a surv&eacute;cu
  durant tout ce temps. Il est devenu imposant et mature, avec une
  communaut&eacute; active et de bonnes perspectives. Le meilleur &eacute;tant le plaisir
  que nous avons toujours &agrave; le programmer.
</p>



<h2>&Agrave; propos du programme</h2>

<h3>Fonctionnera-t-il sur mon ordinateur&nbsp;?</h3>

<p>
  LilyPond est &eacute;crit pour Unix, et devrait tourner sur toutes les variantes
  actuelles d'Unix, dont GNU/Linux, MacOS X et l'environnement Cygwin.
  Il existe &eacute;galement un port pour Windows.
</p>

<h3>Open-source, &ccedil;a veut dire que je dois compiler &agrave; partir des sources&nbsp;?</h3>
<p>
  Non. Compiler LilyPond est un processus assez particulier. &Agrave; moins
  d'&ecirc;tre s&ucirc;r de ce que vous faites, il est recommand&eacute; d'utiliser les
  paquets.
</p>

<h3>Quelle version devrais-je utiliser&nbsp;?</h3>
<p>
  Nous utilisons le m&ecirc;me sch&eacute;ma de num&eacute;rotation que celui utilis&eacute; pour le
  noyau Linux. Cel&agrave; veut dire que les versions mineures paires (1.4, 1.6, etc.)
  sont stables, tandis que les versions de d&eacute;veloppement sont num&eacute;rot&eacute;es
  avec des chiffres impairs (1.5, 1.7). &Agrave; moins de besoins particuliers,
  il vaut mieux choisir la branche stable.
</p>

<h3>Comment utilise-t-on LilyPond&nbsp;?</h3>

<p>
  LilyPond est un compilateur&nbsp;: la musique est cod&eacute;e dans un fichier
  <tt>.ly</tt>. Lors de l'ex&eacute;cution de LilyPond sur ce fichier, le code
  est transform&eacute; en notation musicale, qui peut &ecirc;tre &eacute;crite aux formats
  PostScript, PDF, T<sub>E</sub>X ou PNG.
</p>

<h3>Quel est le format de saisie&nbsp;?</h3>
<p>
  Nous avons cr&eacute;&eacute; notre propre format, le format <tt>.ly</tt>. C'est
  un langage qui code de la musique via des expressions. Ces expressions
  musicales sont compos&eacute;es d'expressions musicales plus simples, les plus
  primaires &eacute;tant les notes et les silences. Ceci est comparable &agrave; la
  d&eacute;composition d'expressions arithm&eacute;tiques en expressions plus simples,
  les plus primaires &eacute;tant les nombres et les op&eacute;rateurs.
</p>


<h3>Il existe de nombreux formats de qualit&eacute;, pourquoi ne pas utiliser
  ABC, MusicXML, NIFF ou DARMS&nbsp;?</h3>

Nous avons les exigences suivantes. Il doit
<ul>
  <li>
    utiliser ASCII,
  </li>
  <li>
    &ecirc;tre suffisamment court pour &ecirc;tre tap&eacute; &agrave; la main,
  </li>
  <li>
    avoir une sp&eacute;cification formelle concise,
  </li>
  <li>
    &ecirc;tre assez expressif afin de supporter plusieurs types de
    notation et de formats d'impression.
  </li>
</ul>

<p>
  Nous pensons qu'aucun format existant ne respecte ces exigences.
  Par exemple, MusicXML ne peut &ecirc;tre saisi &agrave; la main, DARM est
  limit&eacute; dans son application, ABC n'a pas de d&eacute;finition formelle,
  et NIFF est binaire. Cependant, rien ne vous emp&ecirc;che d'utiliser ces formats&nbsp;:
  des filtres existent qui permettent de convertir divers formats au
  format <tt>.ly</tt>.
</p>

<h3>Le format LilyPond utilise des accolades et des backslashes,
  il s'agit donc de TeX, non&nbsp;?</h3>

<p>
  Non. La syntaxe est compl&egrave;tement diff&eacute;rente. Tex est un langage de macros,
  dans lequel chaque commande ou caract&egrave;re peut &ecirc;tre red&eacute;fini. LilyPond
  poss&egrave;de une syntaxe d'entr&eacute;e structur&eacute;e, sous la forme d'une grammaire
  sans contexte. Ainsi il est moins flexible, mais il est aussi plus
  difficile de commettre des erreurs.
</p>
<p>
  LilyPond peut g&eacute;n&eacute;rer la notation au format TeX, pour &ecirc;tre compil&eacute;
  par LaTeX.
</p>

<h3>LilyPond est li&eacute; &agrave; la musique et &agrave; TeX, c'est donc MusicTeX&nbsp;?</h3>

<p>
  Non. Il existe un ensemble de macros TeX (MusicTeX, MusixTeX,
  OpusTeX, MuTex) permettant d'&eacute;diter de la musique. Il n'y a aucun
  lien entre ces logiciels et LilyPond&nbsp;: ils ne sont pas n&eacute;cessaires
  &agrave; l'ex&eacute;cution de LilyPond.
</p>
<p>
  Avant LilyPond, nous avons d&eacute;velopp&eacute; MPP, un pr&eacute;processeur pour
  MusicTeX. Cependant, nous l'avons abandonn&eacute; en 1996, apr&egrave;s avoir
  conclu qu'une bonne mise en page automatis&eacute;e n'&eacute;tait pas
  r&eacute;alisable avec MusicTeX.
</p>


<h3>Comment puis-je apprendre la syntaxe&nbsp;?</h3>
<p>
  Jetez un oeil au
  <a href="@DOC@v2.6/Documentation/user/out-www/lilypond.html#Tutorial">tutoriel</a>.
  Il est assez court, divis&eacute; en sous-parties facilement abordables,
  et nous avons pass&eacute; beaucoup de temps &agrave; le paufiner.
  Si vous pr&eacute;f&eacute;rez vous lancer tout de suite, vous pouvez acc&eacute;der
  au texte d'entr&eacute;e saisi pour chaque exemple en cliquant sur
  les extraits musicaux du tutoriel.
</p>

<h3>Pourriez-vous ajouter des param&egrave;tres aux macros de saisie&nbsp;?</h3>

<p>
  LilyPond ne poss&egrave;de pas de macros de saisie. Il supporte les identifiants&nbsp:
  une partie de la saisie peut &ecirc;tre nomm&eacute;e, et le contenu de cet identifiant
  se substitue &agrave; son nom lorsqu'il est utilis&eacute;. Il ne s'agit d'ailleurs
  pas d'une substitution litt&eacute;rale&nbsp; c'est la repr&eacute;sentation interne de l'objet
  qui est ins&eacute;r&eacute;e dans les &eacute;l&eacute;ments analys&eacute;s.
</p>

<h3>Pourriez-vous ajouter des macros &agrave; la syntaxe&nbsp;?</h3>
<p>
  Non. La programmation avec substitutions de textes (macros) conduit
  &agrave; d'horribles probl&egrave;mes syntaxiques. Une interface de programmation
  utilisant des macros est extr&egrave;mement sensible aux appellations
  non pertinentes et aux d&eacute;tails de format.
</p>

<h3>Mais je n'ai besoin de macros que pour une
  simple tache r&eacute;p&eacute;titive.</h3>
<p>
  Peut-&ecirc;tre, mais n'oubliez pas que vous passerez sans doute plus de temps
  &agrave; lire le .ly qu'&agrave; l'&eacute;crire. Souvent, un peu plus de texte n'est pas une
  mauvaise id&eacute;e. S'il s'agit de choses simples, vous pouvez tout aussi
  bien utiliser des pr&eacute;processeurs existants tels que CPP ou M4.
</p>
<p>
  Vous pouvez &eacute;galement utiliser la commande <tt>\apply</tt>. Elle permet
  de manipuler les expressions musicales dans leur repr&eacute;sentation interne,
  en utilisant le langage de programmation Scheme int&eacute;gr&eacute;.
</p>

<h3>Arr&ecirc;tez de changer la syntaxe continuellement&nbsp;!</h3>
<p>
  Nous essayons de rendre LilyPond le meilleur possible, ce qui implique
  l'am&eacute;lioration continuelle du format de saisie. Nous changeons la syntaxe
  d&egrave;s que nous sentons qu'elle peut simplifier l'ensemble du langage, ou
  qu'elle en rend plus facile l'apprentissage. N'oubliez pas que si la
  syntaxe est bonne aujourd'hui, c'est parce que nous l'avons chang&eacute;e
  dans le pass&eacute;.
</p>

<p>
  La plupart des changements de syntaxe peut &ecirc;tre trait&eacute;e en utilisant le
  programme <tt>convert-ly</tt>, fourni avec LilyPond. Cependant, 
  <tt>convert-ly</tt> ne peut fonctionner qu'&agrave; condition de conna&icirc;tre
  la version d'origine du fichier. Pour ce faire, il est important
  d'ajouter la commande <code>version</code> &agrave; votre fichier comme ceci&nbsp;:
  <xmp>\version "1.3.17" </xmp>
</p>
<p>
  Les changements ne pouvant &ecirc;tre effectu&eacute;s par de simples modifications
  sont marqu&eacute;s par une note dans la version la plus &eacute;lev&eacute;e&nbsp;: convertir
  les fichiers de la version 1.8 &agrave; la version 2.0 n&eacute;cessite une relecture.
</p>

<h3>La saisie de la musique avec LilyPond est-elle rapide&nbsp;?</h3>

<p>
  Il n'y a pas de r&eacute;ponse unique &agrave; cette question, le temps pass&eacute; d&eacute;pendant
  de la complexit&eacute; de la musique, et de votre aisance avec LilyPond. Une
  pi&egrave;ce avec des &eacute;l&eacute;ments compliqu&eacute;s (d&eacute;placement d'une voix sur deux port&eacute;es,
  collisions) demande plus de temps qu'une simple m&eacute;lodie. Des utilisateurs
  exp&eacute;riment&eacute;s ont annonc&eacute; avoir saisi en moyenne 3,5 pages de musique
  monophonique en une heure, avec un &eacute;diteur de texte uniquement. Cette dur&eacute;e
  inclut les corrections et un minimum d'outils de mise en page.
</p>


<h3>Je voudrais utiliser mon clavier MIDI pour la saisie</h3>


&Agrave; essayer&nbsp;:

<ul>
  <li>
    la <a href="http://mail.gnu.org/archive/html/gnu-music-discuss/2001-10/msg00018.html">saisie MIDI pour emacs</a>
    de Hans Lub
  </li>
  <li>
    la <a href="http://nicolas.sceaux.free.fr/lilypond">saisie MIDI pour emacs</a>
    de Nicolas Sceaux
  <li>
    <a href="http://www.volny.cz/smilauer/rumor/rumor.html">RUMOR</a>,
    outil de saisie MIDI/LilyPond monophonique en ligne de commande
  </li>

  <li>
    <a href="http://lilycomp.sf.net">LilyComp</a>, 
    outil de saisie graphique, pour les non-lecteurs de musique
  </li>
</ul>

<h3>Je ne veux pas apprendre d'autre syntaxe. Comment je fais&nbsp;?</h3>
<p>
  Il existe d'autres options&nbsp;: il est possible de cr&eacute;er votre musique dans
  d'autres formats. Les formats support&eacute;s sont&nbsp;:
</p>

<ul>
  <li>
    MIDI&nbsp;: LilyPond inclut midi2ly, programme qui traduit un fichier MIDI
    en fichier LilyPond.
  </li>

  <li>
    ETF&nbsp;: LilyPond inclut etf2ly, un convertisseur pour le format ETF
    de Finale (<a href="../devel/misc/etfformat.html">&agrave; propos de ETF</a>)
  </li>

  <li>
    ABC&nbsp;: LilyPond inclut abc2ly, un convertisseur pour le c&eacute;l&egrave;bre
    format ABC (<a href="http://www.gre.ac.uk/~c.walshaw/abc/">&agrave; propos de ABC</a>).
  </li>

  <li>
    MusicXML&nbsp;: <a href="http://www.nongnu.org/xml2ly/">xml2ly</a> de Guido Amoruso
    convertit MusicXML en LilyPond.  (<a href="http://www.musicxml.org/">&agrave; propos
    de MusicXML</a>).
  </li>

  <li>
    NoteWorthy&nbsp;: <a href="http://nwc2ly.sourceforge.net/">nwc2ly</a> de Mike Wiering
    convertit le format NWC au format LilyPond.
  </li>

  <li>
  	 Band In A Box&nbsp;: <a href="http://people.ee.ethz.ch/~brenzala/builder.php?content=projects_biabconverter&lang=en">biabconverter</a>
    d'Alain Brenzikofer convertit les fichiers Band-in-a-box au format LilyPond.
  </li>
</ul>


<h3>Je voudrais utiliser une interface graphique&nbsp;!</h3>
<p>
  Nous n'avons pas le temps de construire une interface graphique. Heureusement,
  d'autres ont pu le faire. Les logiciels suivants ont des fonctions efficaces
  d'export au format LilyPond, et sont activement d&eacute;velopp&eacute;s.
</p>

<ul>
  <li>
    <a href="http://rnvs.informatik.tu-chemnitz.de/~jan/noteedit/noteedit.html">
      NoteEdit</a>
  </li>
  <li>
    <a href="http://www.all-day-breakfast.com/rosegarden/">RoseGarden</a>
  </li>
</ul>
Il existe &eacute;galement diff&eacute;rentes interfaces non graphiques&nbsp;:

<ul>
  <li> <a href="http://www.volny.cz/smilauer/rumor/rumor.html">RUMOR</a>
    est une interface g&eacute;n&eacute;rant l'entr&eacute;e LilyPond &agrave; l'aide d'un clavier MIDI.
  </li>
  <li><a
	 href="http://nicolas.sceaux.free.fr/lilypond/lyqi.html">LyQI</a>
    permet d'utiliser le clavier de l'ordinateur comme un clavier de piano
    dans emacs. Il est &eacute;galement appel&eacute; RUMOR.
  </li>
</ul>


<h2>Support</h2>

<h3>&Agrave; l'aide, impossible de l'installer ou de le compiler.
	O&ugrave; puis-je trouver de l'aide&nbsp;?</h3>

<p>
  Si vous utilisez un paquet qui ne s'installe pas correctement, ou si
  suivre les instructions ne s'av&egrave;re pas concluant, alors envoyez un
  rapport de bogue &agrave; <a href="mailto:bug-lilypond@gnu.org">bug-lilypond@gnu.org</a>.
  Bien s&ucirc;r vous pouvez &eacute;galement &eacute;crire &agrave; la liste <a 
  		href="http://mail.gnu.org/mailman/listinfo/lilypond-user">lilypond-user</a>
  pour obtenir de l'aide.
</p>

<h3>&Agrave; l'aide, je n'arrive pas &agrave; lui faire faire quelque chose.
	O&ugrave; puis-je trouver de l'aide&nbsp;?</h3>
<p>
  Vous pouvez &eacute;crire &agrave; la liste lilypond-user (disponible sur <a
			href="http://mail.gnu.org/mailman/listinfo/lilypond-user">http://mail.gnu.org/mailman/listinfo/lilypond-user</a>).
  Rechercher dans les archives de cette liste (disponibles sur <a
		  href="http://mail.gnu.org/archive/html/lilypond-user/">http://mail.gnu.org/archive/html/lilypond-user/</a>)
  est aussi une bonne id&eacute;e.
</p>

<a name="bugreport"></a>

<h3>J'ai trouv&eacute; un bogue</h3>

<p>
  Si votre saisie entraine un crash ou une sortie erron&eacute;e, c'est un bogue.
  Nous essayons de r&eacute;pondre aux rapports de bogue rapidement, et de les
  corriger d&egrave;s que possible. Nous avons besoin de reproduire et d'isoler
  le probl&egrave;me pour cel&agrave;. Merci de nous aider en envoyant un bon rapport
  de bogue&nbsp;: un fichier d'entr&eacute;e qui reproduira le probl&egrave;me. Merci
  de le faire court, afin de facilement isoler le probl&egrave;me. N'oubliez pas 
  de pr&eacute;ciser la version que vous utilisez, ainsi que la plate-forme.
  Envoyez votre rapport &agrave; <a
				href="mailto:bug-lilypond@gnu.org">bug-lilypond@gnu.org</a>.
</p>

<h3>Pourriez vous ajouter cette fonctionnalit&eacute; pour moi&nbsp;?</h3>

<p>
  Nous lirons votre demande et y r&eacute;l&eacute;chirons, mais nous
  fixons nos propres objectifs pour l'ajout de fonctionnalit&eacute;s.
  Nous dire pourquoi vous en avez besoin, pourquoi ce serait une si
  bonne id&eacute;e de l'ajouter attirera plus notre attention sur votre demande.
</p>

<p>
  Si vous avez un r&eacute;el besoin de quelque chose, vous pouvez &eacute;galement
  engager un des d&eacute;veloppeurs pour le r&eacute;aliser.
</p>

<h3>Mais c'est vraiment simple, &eacute;tendre la syntaxe de cette mani&egrave;re&hellip;</h3>

<p>
  Il est tentant de penser qu'inventer la syntaxe r&eacute;soud le probl&egrave;me.
  En pratique, moins de 10% du programme traite le format d'entr&eacute;e et
  la syntaxe. La plupart du temps, ajouter des fonctionnalit&eacute;s
  implique bien plus que le traitement de la syntaxe, et est ainsi
  plus complexe.
</p>