<!--
    Translation of GIT Committish: ba28417a402a4539bab93eb8137cd43d9ac919df

    When revising a translation, copy the HEAD committish of the
    version that you are working on.  Refer to `UPDATE A TRANSLATION'
    in README for details.
!-->

<h2>LilyPond existe gr&acirc;ce &agrave;</h2>

<ul>
  <li>Han-Wen Nienhuys et Jan Nieuwenhuizen, d&eacute;veloppement principal
    <p>
      Jan est actuellement sp&eacute;cialiste en d&eacute;veloppement de
      solutions &laquo;&nbsp;Open Source&nbsp;&raquo;. Il est altiste. Han-Wen monte
      une soci&eacute;t&eacute; de promotion de LilyPond.  Il consacre son
      temps libre &agrave; la pratique du cor.
    </p>
    <p>
      Jan et Han-Wen se sont rencontr&eacute;s au sein d'un orchestre de
      jeunes en Hollande.  Jan bricolait des pr&eacute;processeurs MusicTex.
      Quand Han-Wen a mis le doigt dans l'engrenage, ils
      d&eacute;cid&egrave;rent de red&eacute;marrer avec une approche
      compl&egrave;tement diff&eacute;rente. C'est ainsi qu'est n&eacute;
      LilyPond.
    </p>  
    <p>
      <a href="name.html">Des origines</a> du nom &lsquo;LilyPond&rsquo;
    </p>
  </li>

  <li>Graham Percival, &eacute;diteur de la documentation et ma&icirc;tre des bogues
    <p>
      Graham termine une formation diplomante en MAO appliqu&eacute;e &agrave;
      l'enseignement pour instruments.  Son travail est plus
      particuli&egrave;rement ax&eacute; sur le d&eacute;veloppement d'outils &agrave; l'usage des
      &eacute;l&egrave;ves en violon, alto et violoncelle.
    </p>
  </li>

  <li>Pedro Kr&oelig;ger, Ma&icirc;tre de construction
    <p>
      Pedro est professeur de composition, harmonie et contrepoint &agrave;
      l'universit&eacute; f&eacute;d&eacute;rale de Bahia, au Br&eacute;sil.
      Il consacre son temps libre &agrave; l'alto et &agrave; la programmation.
    </p>
  </li>

  <li>Mats Bengtsson, gourou de l'aide aux utilisateurs</li>
</ul>


<h2><a name="website"><tt>lilypond.org</tt> existe gr&acirc;ce &agrave;</h2>

<ul>
  <li>Tineke de Munnik, traduction n&eacute;erlandaise,</li>
  <li>
    Jean-Charles Malahieude, Gauvain
    Pocentek et John Mandereau, traduction fran&ccedil;aise,
  </li>
  <li>Francisco Vila et Daniel Tonda Castillo, traduction espagnole,</li>
  <li>Till Rettig, traduction allemande.</li>
  <li>Yoshinobu Ishizaki, traduction japonaise.</li>
</ul>


<h2>Merci &agrave; ..</h2> 

.. tous les <a
href="@DOC@latest/Documentation/topdocs/AUTHORS.html">codeurs de LilyPond</a>,
chasseurs de bogues et utilisateurs. Remerciements particuliers &agrave;

<ul>
  <li>Werner Lemberg pour sa TeXpertise,</li>
  <li>David Chan et Chris Sawer, pour leur gestion de l'archive Mutopia,</li>
  <li>Matthias Neeracher, pour les mises &agrave; jour du portage vers
    MacOS X fink,</li>
  <li>Paul Roberts et James Ingram, pour les astuces de gravure,</li>
  <li><a href="http://www.stumptuous.com">Krista Scott-Dixon</a>, pour la
    photographie des n&eacute;nuphars.</li>
</ul>
