<!--
    Translation of CVS Revision: 1.7 
    
    Translators must leave this comment in tact, but remove any dollar
    signs ($) from the CVS Revision indicator.

    When revising a translation, copy the CVS Revision number from the
    original source file.  !-->


<a name="engraving"></a>


<img src="@IMAGES@hader-slaan.jpeg" align="right">

<h2>Gravure musicale</h2>

<p>
Lorsque le symbole &agrave; imprimer est d&eacute;fini, il reste &agrave; d&eacute;cider o&ugrave; il
sera plac&eacute; pour obtenir un r&eacute;sultat agr&eacute;able. Cet art est celui de la
<em>gravure musicale</em>. Ce terme vient du proc&eacute;d&eacute; traditionnel
de l'impression musicale. Il y a encore quelques d&eacute;cennies, les 
partitions &eacute;taient faites en taillant et ciselant la musique
dans des plaques de zinc ou d'&eacute;tain, en inverse, comme dans un miroir.
Ces plaques &eacute;taient encr&eacute;es et les reliefs cr&eacute;&eacute;s par les poin&ccedil;ons et
les d&eacute;coupes retenaient l'encre. La partition &eacute;tait alors r&eacute;alis&eacute;e
en pressant le papier contre la plaque. D&eacute;coupes et poin&ccedil;ons &eacute;taient
enti&egrave;rement faits &agrave; la main. Dans la mesure o&ugrave; les corrections &eacute;taient
presque irr&eacute;alisables, la gravure devait &ecirc;tre correcte d&egrave;s le premier 
essai. Cela demande &eacute;videmment une tr&egrave;s grande habilet&eacute;.
</p>
<ul>
<li> La gravure musicale est un m&eacute;tier d'artisan, appris sur le tas.
Un graveur ne devenait un ma&icirc;tre accompli qu'apr&egrave;s une dizaine d'ann&eacute;es de pratique.</li>

<li> La plupart des connaissances se transmet de ma&icirc;tre &agrave; &eacute;l&egrave;ve,
par la pratique. De ce fait, peu de choses ont &eacute;t&eacute; &eacute;crites sur les r&egrave;gles
d'une gravure de qualit&eacute;.</li>

<li> Enfin, la gravure est une question de choix de dimensions et de
noirceur des partitions. <img align=right src="@IMAGES@stone-distance.png">
La qualit&eacute; du r&eacute;sultat final doit &ecirc;tre jug&eacute;e visuellement.
Il est quasiment impossible de la formaliser avec des r&egrave;gles strictes.</li>

</ul>

<br clear="all">
<p align="right">
Suite&nbsp;: <a href="implementing-typography.html">Encrer les
&eacute;crans</a>&nbsp;? Les programmeurs s'attaquent aux probl&egrave;mes
de la gravure.
</p>
