<!--
    Translation of CVS Revision: 1.7 
    
    Translators must leave this comment in tact, but remove any dollar
    signs ($) from the CVS Revision indicator.

    When revising a translation, copy the CVS Revision number from the
    original source file.  !-->

<a name="introduction"></a>

<h2>Qu'est ce qui cloche dans la notation musicale informatis&eacute;e&nbsp;?</h2>

<p>
Nous aimons qualifier LilyPond de &laquo;&nbsp;syst&egrave;me de gravure
automatis&eacute;e&nbsp;&raquo;. Il
mettra joliment en forme la notation musicale sans que
l'utilisateur n'ait besoin d'&ecirc;tre un expert en typographie.
</p>

<p>
LilyPond n'est pas le seul &agrave; r&eacute;aliser de la notation musicale&nbsp;:
il existe de nombreux programmes qui impriment de la musique, et de
nos jours la majorit&eacute; de la musique nouvellement imprim&eacute;e sort d'un ordinateur. 
Malheureusement, ceci a une cons&eacute;quence&nbsp;: n'importe quel musicien
jouant de la musique classique vous dira que les nouvelles partitions ne sont pas
aussi belles que les anciennes &ndash;&nbsp;disons, celles d'avant 1970&nbsp;&ndash;
celles d'aujourd'hui ont un aspect terne et m&eacute;canique. Elles sont
vraiment d&eacute;sagr&eacute;ables &agrave; lire.
</p>
<p>
Pour illustrer ces propos, consid&eacute;rons les exemples suivants. Toutes
deux sont des &eacute;ditions de la 1<sup>&egrave;re</sup> Suite pour violoncelle de
J.S.&nbsp;Bach. Celle de gauche offre une tr&egrave;s jolie &eacute;dition de 1950 grav&eacute;e
&agrave; la main, alors qu'&agrave; droite se trouve un produit typique de
l'informatique contemporaine. Arr&ecirc;tez-vous quelques secondes sur
chacune de ces pages pour bien vous impr&eacute;gner de leur aspect. Laquelle
pr&eacute;f&eacute;rez-vous, et pourquoi&nbsp;?
</p>
<p>
<table>
<tr><td align="center">
<img src="@IMAGES@baer-suite1-fullpage.png">
</td><td align="center">
<img src="@IMAGES@henle-suite1-fullpage.png">
</td></tr>
<tr><td align="center">B&auml;renreiter (BA 350, (c) 1950)</td>
<td align="center">Henle (nr. 666 (c) 2000)</td>
 </tr>
</table>
</p>
<p>

L'image de gauche est jolie&nbsp;: ses lignes sont fluides et il y a
du mouvement. C'est de la musique, et c'est vivant. Passons maintenant
&agrave; l'image de droite, qui nous offre la m&ecirc;me musique &eacute;crite par Bach,
assur&eacute;ment pleine de vie et de fluidit&eacute;... N&eacute;anmoins, la partition n'en
laisse rien transpara&icirc;tre&nbsp;: elle a l'air rigide et
m&eacute;canique. Afin de mieux comprendre de quoi il retourne, examinons de
plus pr&egrave;s un extrait de ces deux pi&egrave;ces&nbsp;:
</p>
<p align="center">

<img src="@IMAGES@baer-suite1-line.png">
</p>
<p align="center"> fait &agrave; la main
<p><br>

<p align="center">

<img src="@IMAGES@henle-suite1-line.png">
</p>
<p align="center"> fait par ordinateur
</p>
<p>

L'emplacement des barres de mesure est assez r&eacute;v&eacute;lateur. Dans la
nouvelle &eacute;dition, les deux barres de mesure sont
exactement align&eacute;es horizontalement. Il en va de m&ecirc;me pour les notes. Si l'on revient
&agrave; l'int&eacute;gralit&eacute; de la page, il est &eacute;vident que presque toutes les
barres de mesure sont align&eacute;es horizontalement, tout
comme la plupart des notes. L'ensemble para&icirc;t espac&eacute; 
comme si tout &eacute;tait plac&eacute; sur un quadrillage, provoquant cette
impression m&eacute;canique.
</p>

<p>
Ce n'est pas la seule erreur de cet exemple et, de plus, cette pi&egrave;ce
n'est pas la seule &agrave; comporter des erreurs
typographiques. Malheureusement, presque toute la musique imprim&eacute;e de
nos jours est truff&eacute;e de grossi&egrave;res fautes de typographie.
</p>

<p>
Les musiciens sont normalement plus concentr&eacute;s sur la mani&egrave;re dont ils
jouent la musique que sur son apparence, aussi ces pinailleries sur
des d&eacute;tails de typographie peuvent para&icirc;tre acad&eacute;miques. Ce n'est pas
justifi&eacute;. Cette pi&egrave;ce-ci a un rythme monotone. Si toutes les lignes
se ressemblent, elles finissent par former un labyrinthe. Si le
musicien la quitte des yeux ou se d&eacute;concentre un instant, il ne saura
plus o&ugrave; il en est dans la page.
</p>

<p>
En g&eacute;n&eacute;ral, c'est une caract&eacute;ristique commune de la typographie. La
pr&eacute;sentation devrait &ecirc;tre soign&eacute;e, non seulement pour l'amour de
l'art, mais plus sp&eacute;cialement parce qu'elle vient en aide au lecteur
dans sa t&acirc;che. Pour du mat&eacute;riel d'interpr&eacute;tation tel que les
partitions de musique, ceci est doublement important&nbsp;: les
musiciens sont limit&eacute;s dans leur attention. Au moins leur attention se
porte sur la lecture, au plus ils peuvent se concentrer sur
l'ex&eacute;cution. En d'autres termes, une meilleure typographie se traduit
par une meilleure interpr&eacute;tation.
</p>

<p align="right">

Suite&nbsp;: <a href="software.html">Ce qui ne va pas avec les
logiciels</a>, ou pourquoi Finale n'est pas la panac&eacute;e en terme de
logiciel de musique.
</p>