<!--
    Translation of CVS Revision: 1.8 
    
    Translators must leave this comment in tact, but remove any dollar
    signs ($) from the CVS Revision indicator.

    When revising a translation, copy the CVS Revision number from the
    original source file.  !-->

<a name="software"></a>
<h2>Ce qui ne va pas dans les logiciels de notation musicale</h2>

<p>
Les ordinateurs ont rendu l'impression de la musique accessible au
grand public, mais sont plut&ocirc;t m&eacute;diocres pour ce qui est de la
typographie. Selon toute vraisemblance, les programmeurs ont fait un
travail b&acirc;cl&eacute; pour les logiciels de notation. Pour illustrer ceci,
nous avons demand&eacute; &agrave; un utilisateur amateur de saisir un morceau de
musique avec l'un des plus populaires programmes
&laquo;&nbsp;professionnels&nbsp;&raquo; de notation vendus aujourd'hui, Finale
2003. Les r&eacute;glages par d&eacute;faut ont &eacute;t&eacute; utilis&eacute;s.
La musique est extraite de la Sarabande de la 2<sup>e</sup> Suite
pour violoncelle de J.S. Bach.

<p>
<em>
(Finale est une marque d&eacute;pos&eacute;e par MakeMusic! Inc.)
</em>


<p align="center" >

<img align="center"  src="@IMAGES@finale-sarabande-full.png">

<p> 
Cet exemple surpasse de loin ce que nous avons d&eacute;j&agrave; vu en mati&egrave;re
d'erreurs de mise en forme&nbsp;: en fait, des erreurs cons&eacute;quentes sont pr&eacute;sentes &agrave; 
<em>chaque</em> mesure. Ces erreurs sont de tout acabit&nbsp;: une
faute monumentale est l ' e s p a c e m e n t&nbsp;&nbsp;d &eacute; m e s u r &eacute;
de la derni&egrave;re ligne. Une autre, moins importante, est le b&eacute;mol de la
mesure 13 recouvert par la note qui le pr&eacute;c&egrave;de. Voici un
agrandissement de cette mesure&nbsp;: <p align="center" > <img align="center"
src="@IMAGES@finale-flat-detail.png">
<p>
Les erreurs se retrouvent jusque dans les plus infimes d&eacute;tails&nbsp;:
ci-dessous un agrandissement du lien de cette mesure. Bien entendu
les r&egrave;gles de bonne typographie voudraient que ce lien ne d&eacute;borde
pas de la hampe, et les cannelures mettent en &eacute;vidence la ma&icirc;trise
(ou son absence) des principes de la technologie PostScript par les programmeurs
de Coda Music Technology.

<p align="center" >
<img src="@IMAGES@finale-beam-detail.png">
<p>

Bien s&ucirc;r, on peut r&eacute;futer que Finale dispose d'une interface
graphique, qu'il vous permet de d&eacute;placer les &eacute;l&eacute;ments pour corriger
des erreurs ou d'utiliser des greffons (<i>plug-in</i>) qui s'en
chargeront. C'est certainement vrai&nbsp;: en fait, un bon graveur
professionnel qui utilise Finale passera en r&eacute;alit&eacute; la plupart de son
temps &agrave; corriger les fautes produites par Finale. Mais seriez-vous
pr&ecirc;t &agrave; corriger des erreurs flagrantes &agrave; longueur de temps&nbsp;? Pour
ce qui est de la ligne &agrave; l'espacement d&eacute;mesur&eacute;, c'est faisable, mais
imaginons qu'il faille corriger chaque partie de lien qui d&eacute;borde
d'une hampe... manuellement&nbsp;?

<p>
Il y a une autre raison, moins &eacute;vidente, pour laquelle corriger &agrave; la
main n'est pas une si bonne id&eacute;e. Revenons &agrave; cette mesure 13. Le b&eacute;mol
mal plac&eacute; saute aux yeux, mais avez-vous remarqu&eacute; quelque chose &agrave;
propos de la barre de reprise&nbsp;?  Ses lignes sont trop
espac&eacute;es. Avez-vous vu que le demi-soupir est bien trop bas,
et que la hampe de la derni&egrave;re croche est trop longue&nbsp;?

<p align="center" >
<img src="@IMAGES@finale-flat-correct.png">
<p>
&Agrave; moins d'&ecirc;tre un expert, les fautes de typographie vous empoisonnent
la vie sans vous sauter aux yeux. Nombre d'entre elles ne seront pas
corrig&eacute;es et subsiteront dans l'&eacute;dition d&eacute;finitive.

<p>
Cet exemple peut sembler quelque peu exag&eacute;r&eacute;, mais en r&eacute;alit&eacute; ce n'est
pas le cas. Tous les grands producteurs de logiciel de notation
pr&eacute;tendent se conformer aux standards de la gravure, mais aucun d'eux
n'en ma&icirc;trise correctement les bases, et tous font des erreurs
flagrantes. Pour juger du r&eacute;sultat de votre logiciel pr&eacute;f&eacute;r&eacute;,
procurez-vous une partition convenable &eacute;dit&eacute;e par une bonne vieille
maison, copiez-en une page, puis comparez-les&nbsp;:

<ul>
<li>
Qu'en est-il de l'aspect g&eacute;n&eacute;ral de la page&nbsp;? La plupart du temps,
les partitions informatis&eacute;es ont un espacement plus large, de telle
sorte  qu'elles tiennent sur plus de pages et par voie de cons&eacute;quence
plus de tournes.

<li>
Qu'en est-il de l'espacement&nbsp;? Est-ce aussi vivant et fluide que
la partition grav&eacute;e &agrave; la main&nbsp;? En cas de doute, il suffit de
mesurer &agrave; la r&egrave;gle.

<li>
Posons chacun des exemplaires sur un pupitre &agrave; un m&egrave;tre, comme pour
jouer en concert. Les deux sont-il parfaitement lisibles&nbsp;?
Pratiquement toutes les partitions informatis&eacute;es ont l'air p&acirc;le&nbsp;:
les lignes sont trop fines et les symboles trop clairs. C'est ce qui
les rend difficiles &agrave; lire de loin. Si le doute persiste, il suffit de
regarder &agrave; la loupe.

</ul>



<p align="right">
Suite&nbsp;: <a href="problem-statement.html">Ce &agrave; quoi nous aspirons,
mais dont nous ne disposions pas jusqu'alors</a>&nbsp;: un logiciel de
notation musicale plus performant.</p>

