Repository: angeleyes/lilypond
Catalog: po/*.po
Languages: hu, ru

source: EOF in a string
ru: EOF в строке

source: warning:
ru: предупреждаю:

source: not enough fields in Dstream init
ru: не достаточно полей в Dstream init

source: option `%s' requires an argument
ru: опция `%s' требует аргумент

source: option `%s' doesn't allow an argument
ru: опция `%s' не допускает использование аргумента

source: unrecognized option: `%s'
ru: неизвестная опция: `%s'

source: invalid argument `%s' to option `%s'
ru: неверный аргумент `%s' для опции `%s'

source: error:
ru: ошибка:

source: non fatal error:
ru: не смертельная ошибка:

source: position unknown
ru: положение неизвестно

source: can't map file
ru: не могу отобразить файл в память

source: can't open file: `%s'
ru: не могу открыть файл: `%s'

source: Huh? Got %d, expected %d characters
ru: Хм... Получил %d, а ожидал %d знаков

source: <stdin>
ru: <стандартный ввод>

source: programming error:
ru: ошибка программирования:

source: (Continuing; cross thumbs)
ru: (Продолжаю; скрестите пальцы)

source: can't find character number: %d
ru: не могу найти символ с номером: %d

source: can't find character called: `%s'
ru: не могу найти символ под названием: `%s'

source: can't find font: `%s'
ru: не могу найти шрифт: `%s'

source: Loading default font
ru: Загружаю шрифт по умолчанию

source: can't find default font: `%s'
ru: не могу найти шрифт по умолчанию: `%s'

source: (search path: `%s')
ru: (путь поиска: `%s')

source: Giving up
ru: Сдаюсь

source: Can't switch translators, I'm there already
ru: Не могу переключить переводчиков, я уже там

source: can't find start of beam
ru: что-то не найду начало группировки штилей

source: already have a beam
ru: уже имеем группу штилей

source: unterminated beam
ru: незаконченная группировка штилей

source: stem must have Rhythmic structure
ru: штиль должен иметь ритмовую структуру

source: stem doesn't fit in beam
ru: штиль не влезает в группировку

source: beam was started here
ru: группировка начиналась здесь

source: beam has less than two stems
ru: группировка менее двух штилей

source: weird beam vertical offset
ru: дикое вертикальное смещение группировки штилей

source: can't change `%s' to `%s'
ru: не могу сменить `%s' на `%s'

source: I'm one myself
ru: Я единственный

source: none of these in my family
ru: они мне не родственники

source: unterminated chord tremolo
ru: незаконченное тремоло аккорда

source: invalid subtraction: not part of chord: %s
ru: неверное вычитание: не часть аккорда: %s

source: Too many clashing notecolumns. Ignoring them.
ru: Слишком много пересекающихся столбцов нот. Игнорирую.

source: floating point exception
ru: исключение арифметики с плавающей запятой

source: can't set mem-checking!
ru: не могу включить проверку памяти

source: can't find start of (de)crescendo
ru: не могу найти начало (де)крещендо

source: already have a crescendo
ru: крещендо уже есть

source: already have a decrescendo
ru: декрещендо уже есть

source: unterminated (de)crescendo
ru: незаконченное (де)крещендо

source: unterminated extender
ru: незавершенный расширитель

source: Nothing to connect extender to on the left. Ignoring extender request.
ru: Некуда присоединить расширитель слева. Игнорирую запрос расширителя.

source: no one to print a repeat brace
ru: некому рисовать скобу повтора

source: No feasible line breaking found
ru: Не найдено удовлетворительного разрыва строки

source: no Grace context available
ru: нет доступного Форшлаг-контекста

source: Unattached grace notes. Attaching to last musical column.
ru: Форшлаг без привязки. Привязываю к последнему музыкальному столбцу.

source: unterminated hyphen
ru: перенос без окончания

source: Nothing to connect hyphen to on the left. Ignoring hyphen request.
ru: Не к чему присоединить перенос слева. Игнорирую запрос переноса.

source: wrong identifier type, expected: `%s'
ru: неверный тип переменной, ожидался: `%s'

source: can't find file: `%s'
ru: не могу найти файл: `%s'

source: FIXME: key change merge
ru: ИСПРАВЬМЕНЯ: слияние смены ключа

source: (load path: `%s')
ru: (путь загрузки: `%s')

source: Calculating column positions...
ru: Вычисляю позиции столбцов

source: EXT
ru: РАСШ

source: this help
ru: эта справка

source: DIR
ru: КАТ

source: add DIR to search path
ru: добавить КАТ к пути поиска

source: FILE
ru: ФАЙЛ

source: use FILE as init file
ru: использовать ФАЙЛ как файл инициализации

source: write Makefile dependencies for every input file
ru: записывать зависимости Makefile для каждого входного файла

source: produce MIDI output only
ru: производить вывод только MIDI

source: BASENAME
ru: ОСНОВА

source: write output to BASENAME[-x].extension
ru: записывать вывод в ОСНОВА[-x].расширение

source: show all changes in relative syntax
ru: показывать все изменения в относительном синтаксисе

source: inhibit file output naming and exporting
ru: скрыть именование и экспорт вывода в файл

source: don't timestamp the output
ru: не отмечать дату и время вывода

source: switch on experimental features
ru: включить экспериментальные возможности

source: print version number
ru: выводить номер версии

source: show warranty and copyright
ru: показать гарантию и copyright

source: Usage: %s [OPTION]... [FILE]...
ru: Использование: %s [ОПЦИЯ]... [ФАЙЛ]...

source: Typeset music and or play MIDI from FILE
ru: Набирать музыку и/или проигрывать MIDI из ФАЙЛа

source: LilyPond is a music typesetter. It produces beautiful sheet music using a high level description file as input. LilyPond is part of the GNU Project.
ru: LilyPond - программа набора музыки. Она производит прекрасную музыку на бумаге, используя высокоуровневый файл описания на вводе. Lilypond является частью Проекта GNU.

source: Options:
ru: Опции:

source: This binary was compiled with the following options:
ru: Этот исполняемый файл был собран со следующими опциями:

source: Report bugs to %s
ru: Сообщайте об ошибках по %s

source: This is free software. It is covered by the GNU General Public License, and you are welcome to change it and/or distribute copies of it under certain conditions. Invoke as `%s --warranty' for more information.
ru: Это свободное программное обеспечение. Оно охраняется Общей Открытой Лицензией GNU, и Вы можете изменять его и/или распространять его копии при соблюдении некоторых условий. Вызывайте как `%s --warranty' для получения дополнительной информации.

source: Copyright (c) %s by
ru: Все права защищены (c) %s by

source: no such instrument: `%s'
ru: нет такого инструмента: `%s'

source: unconventional key: flats: %d, sharps: %d
ru: нестандартный ключ: бемоли: %d, диезы: %d

source: silly duration
ru: глупая продолжительность

source: silly pitch
ru: глупый тон

source: Error syncing file (disk full?)
ru: Ошибка синхронизации файла (диск переполнен?)

source: can't find `%s' context
ru: не могу найти контекст `%s'

source: Identifier name is a keyword: `%s'
ru: Имя команды является ключевым словом: `%s'

source: error at EOF: %s
ru: ошмбка в конце файла: %s

source: Parsing...
ru: Разбираю...

source: Braces don't match
ru: Фигурные скобки не совпадают

source: Junking request: `%s'
ru: Выбрасываю запрос: `%s'

source: paper output to %s...
ru: "бумажный" вывод в %s...

source: , at
ru: , в

source: Preprocessing elements...
ru: Предварительно обрабатываю элементы...

source: Track ...
ru: Дорожка ...

source: Creator:
ru: Создатель:

source: Automatically generated
ru: Автоматически сгенерировано

source: from musical definition: %s
ru: из музыкальной нотации %s

source: MIDI output to %s...
ru: вывод MIDI в %s...

source: too many colliding rests
ru: слишком много налезающих пауз

source: Interpreting music...
ru: Интерпретирую музыку...

source: Errors found/*, not processing score*/
ru: Найдены ошибки/*, не обрабатываю ноты*/

source: elapsed time: %.2f seconds
ru: затраченное время: %.2f секунд

source: unterminated slur
ru: незавершенная лига

source: Putting slur over rest. Ignoring.
ru: Лига над паузой. Игнорирую.

source: Slur over rest?
ru: Лига над паузой?

source: Adding note head to incompatible stem (type = %d)
ru: Добавляю ноту к несовместимому штилю (тип = %d)

source: Already contains: `%s'
ru: Уже содержит: `%s'

source: can't find: `%s'
ru: не могу найти: `%s'

source: can't find or create: `%s'
ru: не могу найти или создать: `%s'

source: Second argument must be a symbol
ru: Второй аргумент должен быть символом

source: Can't specify direction for this request
ru: Не могу указать направление для этого запроса

source: Have to be in Lyric mode for lyrics
ru: Должен быть в Лирическом режиме для лирики

source: not a duration: %d
ru: не продолжительность: %d

source: Have to be in Note mode for notes
ru: Должен быть в Нотном режиме для нот

source: Have to be in Chord mode for chords
ru: Должен быть в Аккордном режиме для аккордов

source: EOF found inside a comment
ru: Конец файла внутри комментария

source: Missing end quote
ru: Отсутсвует заключительная кавычка

source: white expected
ru: в то время как ожидалось

source: Can't evaluate Scheme in safe mode
ru: Не могу выполнять код схемы в безопасном режиме

source: invalid character: `%c'
ru: неверный символ: `%c'

source: unknown escaped string: `\%s'
ru: неизвестная escape-последовательность: `\%s'

source: enable debugging output
ru: включить вывод отладочной информации

source: set FILE as default output
ru: установить ФАЙЛ для вывода по умолчанию

source: don't output tuplets
ru: не выводить скобы триолей

source: be quiet
ru: быть молчаливым

source: DUR
ru: МАЖОР

source: set smallest duration
ru: установить наименьшую продолжительность

source: be verbose
ru: быть болтливым

source: Usage: %s [OPTION]... [FILE]
ru: Использование: %s [ОПЦИЯ]... [ФАЙЛ]

source: Translate MIDI-file to mudela
ru: Транслировать MIDI-файл в mudela

source: zero length string encountered
ru: встретилась строка нулевой длины

source: MIDI header expected
ru: ожидался заголовок MIDI

source: invalid header length
ru: неверная длина заголовка

source: invalid MIDI format
ru: неверный формат MIDI

source: invalid number of tracks
ru: неверное число дорожек

source: invalid running status
ru: неверный статус выполнения

source: unimplemented MIDI meta-event
ru: неподдерживаемое мета-событие MIDI

source: invalid MIDI event
ru: неверное событие MIDI

source: MIDI track expected
ru: ожидалась MIDI дорожка

source: invalid track length
ru: неверная длина дорожки

source: #32 in quarter: %d
ru: #32 в четвертной: %d

source: Lily output to %s...
ru: Lily выход в %s...

source: track %d:
ru: дорожка %d:

source: Processing...
ru: Обрабатываю...

source: Creating voices...
ru: Создаю голоса...

source: track
ru: дорожка

source: % MIDI instrument:
ru: % MIDI инструмент:

source: lily indent level: %d
ru: уровень отступов lily: %d

source: % Creator:
ru: % Создатель:

source: % Automatically generated
ru: % Автоматически сгенерировано

source: % from input file:
ru: % из входного файла:

source: Other languages: %s.
hu: Más nyelvek: %s.

source: About <A HREF='%s'>automatic language selection</A>.
hu: Az <A HREF='%s'>automatikus nyelvválasztásról</A>.

source: Home
hu: Kezdőlap

source: First use
hu: Első lépések

source: User help
hu: Használat

source: Getting Help
hu: Segítségkérés

source: Introduction
hu: Bevezetés

source: About
hu: A LilyPondról

source: Download
hu: Letöltés

source: Documentation
hu: Dokumentáció

source: Development
hu: Fejlesztés

source: Help
hu: Segítség

source: Why use LilyPond?
hu: Miért használd a LilyPondot?

source: Testimonials
hu: Ajánlások

source: A short tour
hu: Bemutató

source: Crash course
hu: Gyorstalpaló

source: Features
hu: Képességek

source: FAQ
hu: GyIK

source: Essay
hu: Esszé

source: Publications
hu: Publikációk

source: Acknowledgements
hu: Köszönetnyilvánítás

source: Condense multi-rests
hu: Több ütemes szünetek összevonása

source: Transpose for F instrument
hu: Transzpozíció az F-kürt számára

source: Reuse variable
hu: Egy változó újrafelhasználása

source: Enter chord names
hu: Akkordnevek megadása

source: Enter melody
hu: Dallam megadása

source: Enter lyrics
hu: Dalszöveg megadása

source: Combine melody and lyrics
hu: Dallam és dalszöveg összekapcsolása

source: hornNotes
hu: Kurt

source: bassoonNotes
hu: Fagott

source: Enter multi-rest
hu: Több ütemes szünet

source: Store notes in variable
hu: Hangok eltárolása egy változóban

source: measures
hu: ütemek

source: staff
hu: kottasor

source: Commands start with \
hu: A parancsok a \ karakterrel kezdődnek

source: Letters are notes
hu: A betűk hangokat jelölnek

source: Numbers are durations
hu: A számok jelzik a ritmusértéket

source: Add articulations
hu: Artikulációs jelek

source: Add -es for flat, -is for sharp
hu: A bé megfelelője -es, a kereszté -is

source: Enclose pitches in &lt; &gt; for chords
hu: Az akkordok hangjait &lt; &gt; közé kell zárni

source: Create staff
hu: Kottasor létrehozása

source: Combine staffs in parallel
hu: Kottasorok egymás alá írása

source: Download <a href='%s'>the installer</a>
hu: <a href='%s'>Telepítő</a> letöltése

source: do %s in a command window.
hu: Írd be a következő parancsot: %s

source: LilyPond development team
hu: A LilyPond fejlesztőcsapata

source: Included <a href='%s'>with distribution</a>
hu: A <a href='%s'>disztribúció</a> tartalmazza

source: Go <a href='%s'>here</a>
hu: Lásd <a href='%s'>ezt az oldalt</a>

source: Other
hu: Más operációs rendszerek

source: Download <a href='%s'>%s</a>
hu: <a href='%s'>%s</a> letöltése

source: %s and newer
hu: %s és újabb

source: <a href='%s'>Install</a>
hu: <a href='%s'>Telepítés</a>

source: Documentation and Source code
hu: Dokumentáció és forráskód

source: Download <a href='%s'>tarball</a>
hu: <a href='%s'>Tarball</a> letöltése

source: Source code
hu: Forráskód

source: warning
hu: figyelmeztetés

source: A text-based program, not graphical. For more information, see <a href='%s'>the LilyPond help page</a>.
hu: A LilyPond egy parancssori program. Ha segítségre van szükséged, olvasd el <a href='%s'>ezt</a>.
