<!--
    Translation of GIT committish: 70dccb472f11807fd39e3194421ea1153e0b282f  

    When revising a translation, copy the HEAD committish of the
    version that you are working on.  Use

      git-rev-list HEAD | head -1

    to discover that.
!-->

<a name="software"></a>
<h2>Was stimmt nicht mit den Programmen?</h2>

<p>
Durch den Computer hat das Massenpublikum heute Zugang zum Notensatz,
aber der Computersatz ist &uuml;blicherweise minderwertig. Offensichtlich
haben sich die Programmierer keine große M&uuml;he mit Notationsprogrammen
gegeben. Um das zu zeigen, haben wir einen Amateur gebeten, ein Musikst&uuml;ck
mit einem der beliebtesten &bdquo;professionellen&ldquo; Notationsprogrammen, die heute 
erh&auml;ltlich sind, zu setzten. Er benutzte Finale&thinsp;2003 mit den
Standardeinstellungen. Die Musik stammt aus der Sarabande der zweiten Suite f&uuml;r Violoncello
von J.&thinsp;S.&thinsp;Bach.

<p>
<em>
(Finale ist ein registriertes Markenzeichen der Firma MakeMusic! Inc.)
</em>


<p align="center" >

<img align="center"  src="@IMAGES@finale-sarabande-full.png">

<p> 

Dieses Beispiel &uuml;bertrifft noch das vorhergehende mit seinen
vielf&auml;ltigen Satzfehlern: Hier finden sich jetzt ernsthafte
Fehler in wirklich <em>jedem</em> Takt. Und das sind Fehler aller
Art: Einer ist etwa das seltsam
a&ensp;u&ensp;s&ensp;e&ensp;i&ensp;n&ensp;a&ensp;n&ensp;d&ensp;e&ensp;r&ensp;g&ensp;e&ensp;z&ensp;o&ensp;g&ensp;e&ensp;n&ensp;e letzte System. Ein kleinerer Fehler ist das b in Takt 13, das von der
vorhergehenden Note verdeckt wird. Hier eine Vergr&ouml;&szlig;erung dieses Taktes: <p align="center" > <img align="center"
src="@IMAGES@finale-flat-detail.png">
<p>
Die Fehler reichen bis ins kleinste Detail: Unten ist eine sehr starke
Vergr&ouml;&szlig;erung des selben Taktes zu sehen. Nat&uuml;rlich sollte
der Balken in einem guten Satz nicht rechts &uuml;ber den Hals hinausragen,
und die kleinen B&ouml;gen sind ein vielsagender Hinweis auf die Versiertheit
(oder eben Ignoranz) der Programmierer von Coda Music Technology mit der
PostScript-Technologie.

<p align="center" >
<img src="@IMAGES@finale-beam-detail.png">
<p>

Jetzt k&ouml;nnte man anf&uuml;hren, dass Finale ein graphisches
Programm ist und man damit sehr einfach alle Notationselemente
herumschieben kann, um die Fehler zu beseitigen, oder plug-ins
benutzen kann, die das &uuml;bernehmen. Das stimmt auf jeden Fall &ndash;
in der Tat brauchen gute professionelle Notensetzer die meiste Zeit
daf&uuml;r, all die Fehler zu beseitigen, die Finale standardm&auml;&szlig;ig
macht. Aber ist es denn so angenehm, die ganze Zeit nur Fehler zu korrigieren?
F&uuml;r eine gedehnte Zeile ist das ja noch m&ouml;glich, aber wenn
man jeden einzelnen Balken korrigieren muss, der etwas &uuml;bersteht &ndash; und 
das alles manuell?

<p>
Es gibt noch einen weniger offensichtlichen Grund, warum es keine
gute Idee ist, alles manuell zu korrigieren. Nehmen wir wieder den Takt&thinsp;13
von oben. Dieses falsch plazierte b ist ja ziemlich offensichtlich, aber 
wem ist der Doppelstrich mit den Wiederholungspunkten aufgefallen?
Seine Linien sind zu weit auseinder. Und wer hat bemerkt, dass die
Achtelpause zu tief sa&szlig;? Und dass der Stil der letzten Achtelnote
zu lang ist?

<p align="center" >
<img src="@IMAGES@finale-flat-correct.png">
<p>
Nur ein Experte kann diese Feinheiten wirklich wahrnehmen. &Uuml;blicherweise 
aber werden solche Fehler nicht korrigiert und finden sich dann auch noch
in der endg&uuml;ltigen Version.

<p>

Dieses Beispiel mag konstruiert erscheinen, aber es ist weit davon entfernt.
Alle großen Notationsprogramme behaupten, Notensatzstandards einzuhalten,
aber uns ist kein einziges &uuml;ber den Weg gelaufen, das auch nur
die grundlegendsten Regeln einhalten w&uuml;rde. Alle machen systematisch Fehler.
Um die Satzqualit&auml;t seines eigenen Notationsprogrammes auszuprobieren,
muss man nur ein handgestochenes Notenblatt von einem anerkannten
Verlag kaufen und versuchen, es mit dem Programm zu kopieren. Dann sollte
man beide Versionen vergleichen:

<ul>
<li>
Wie steht es mit dem Layout der Seite? Normalerweise sind
Computernoten weiter gesetzt, so dass sie mehr Seiten f&uuml;llen;
das hei&szlig;t gleichzeitig mehr st&ouml;rendes Bl&auml;ttern.

<li>
Wie sehen die Abst&auml;nde aus? Sind sind sie so flie&szlig;end und
lebendig wie in dem handgestochenen Notenblatt? Bei Zweifeln sollte
man beide Versionen mit dem Lineal ausmessen.

<li>
Wie sehen beide Versionen im Vergleich aus, wenn man sie auf einem
Notenst&auml;nder aus einem Meter Entfernung betrachtet? Das ist 
&uuml;blich w&auml;hrend eines Konzerts. Sind beide Seite gut zu lesen?
Fast alle Computernoten sehen irgendwie kr&auml;nklich aus: Die 
Notenlinien sind zu d&uuml;nn und die Symbole sind zu fein. Deshalb
sind sie schwer aus einiger Entfernung zu lesen. Die Unterschiede
lassen sich am besten mit einem Vergr&ouml;&szlig;erungsglas zeigen.

</ul>



<p align="right">
Weiter: <a href="problem-statement.html">Wie sollte man ein Programm nicht schreiben</a>,
oder Ein Notationsprogramm formen.


